In [23]:
# Welcome to Learning Pandas
# This script will include challenges designed to improve your skills in slicing and filtering data using Pandas.

# Let's start by importing the pandas library
import pandas as pd

# Sample dataset to get us started
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Score': [85, 90, 78, 88, 95]
}

# Create a DataFrame
df = pd.DataFrame(data)
df

      Name  Age         City  Score
0    Alice   24     New York     85
1      Bob   27  Los Angeles     90
2  Charlie   22      Chicago     78
3    David   32      Houston     88
4      Eva   29      Phoenix     95

In [2]:
# First Challenge: Display rows where 'Age' is greater than 25
df.loc[df['Age'] > 25]

    Name  Age         City  Score
1    Bob   27  Los Angeles     90
3  David   32      Houston     88
4    Eva   29      Phoenix     95

In [3]:
df[df['Age']>25]

    Name  Age         City  Score
1    Bob   27  Los Angeles     90
3  David   32      Houston     88
4    Eva   29      Phoenix     95

In [4]:
# Second Challenge: Display only the 'Name' and 'City' columns for rows where 'Score' is greater than 80
df[df['Score'] > 80][['Name', 'City']]

    Name         City
0  Alice     New York
1    Bob  Los Angeles
3  David      Houston
4    Eva      Phoenix

In [5]:
# Third Challenge: Display rows where 'City' is either 'Chicago' or 'Houston'
df[df['City'].isin(['Chicago', 'Houston'])]

      Name  Age     City  Score
2  Charlie   22  Chicago     78
3    David   32  Houston     88

In [ ]:
#1. Using apply() with a Custom Function
#Create a function that:
#	•	Takes an age value and categorizes it into "Young" (≤25) or "Old" (>25).
#	•	Apply this function to the Age column and create a new column called "Age Group".
def categorize_age(age):
    if age <= 25:
        x = 'young'
    else:
        x = 'old'
    return x


df['Age Group'] = df['Age'].apply(categorize_age)
df

      Name  Age         City  Score Age Group
0    Alice   24     New York     85     young
1      Bob   27  Los Angeles     90       old
2  Charlie   22      Chicago     78     young
3    David   32      Houston     88       old
4      Eva   29      Phoenix     95       old

In [ ]:
# LAMBDA: df['column'].apply(lambda x: TRUE if x < 0 else FALSE)

#2. Using lambda in apply()

#Modify the Score column:
#	•	If the score is greater than 85, increase it by 5.
#	•	Otherwise, decrease it by 3.
#	•	Use apply() with a lambda function.

df['new_score'] = df['Score'].apply(lambda x: x + 5 if x > 85 else x - 3)
df

      Name  Age         City  Score Age Group  new_score
0    Alice   24     New York     85     young         82
1      Bob   27  Los Angeles     90       old         95
2  Charlie   22      Chicago     78     young         75
3    David   32      Houston     88       old         93
4      Eva   29      Phoenix     95       old        100

In [ ]:
#3. Using groupby() for Aggregation

#Group the DataFrame by City and:
#	•	Find the average score for each city.
#	•	Count the number of people in each city.

grouped_df = df.groupby('City')

aggregated_df = pd.DataFrame({'avg_score': grouped_df['Score'].mean(), 'count_ppl': grouped_df['Name'].size()})
aggregated_df

# also
aggregated_df = df.groupby("City").agg(avg_score=("Score", "mean"), count_ppl=("Name", "size"))

             avg_score  count_ppl
City
Chicago           78.0          1
Houston           88.0          1
Los Angeles       90.0          1
New York          85.0          1
Phoenix           95.0          1

In [ ]:
#4. Using map() for Value Transformation

#Create a dictionary:
city_map = {"New York": "NY", "Los Angeles": "LA", "Chicago": "CHI", "Houston": "HOU", "Phoenix": "PHX"}

#	•	Use .map() to replace the City column values with their abbreviations.
replaced_df = df.copy()
replaced_df['City'] = replaced_df['City'].map(city_map)
replaced_df

      Name  Age City  Score
0    Alice   24   NY     85
1      Bob   27   LA     90
2  Charlie   22  CHI     78
3    David   32  HOU     88
4      Eva   29  PHX     95

In [28]:
#5. Using filter() for Column Selection
#	•	Use .filter() to return only columns that contain the letter “o” in their names.

df.filter(axis=1, regex='o')

   Score
0     85
1     90
2     78
3     88
4     95

In [29]:
#6. Using query() for Filtering
#	•	Use .query() to select rows where Age is greater than 25 and Score is above 80.

df.query("Age > 25 and Score > 80")

    Name  Age         City  Score
1    Bob   27  Los Angeles     90
3  David   32      Houston     88
4    Eva   29      Phoenix     95

In [30]:
#7. Using pivot_table()

#Create a pivot table where:
#	•	The index is "City",
#	•	The values are "Score",
#	•	The aggregation function is "mean".
pivot_df = df.pivot_table(index='City', values='Score', aggfunc='mean')
pivot_df

             Score
City
Chicago       78.0
Houston       88.0
Los Angeles   90.0
New York      85.0
Phoenix       95.0

In [31]:
#8. Using .transform() for Column-Wide Operations
#	•	Use .groupby("City")["Score"].transform("mean") to calculate each person’s city’s average score and store it in a new column "City Avg Score".

df['City Avg Score'] = df.groupby('City')['Score'].transform('mean')
df

      Name  Age         City  Score  City Avg Score
0    Alice   24     New York     85            85.0
1      Bob   27  Los Angeles     90            90.0
2  Charlie   22      Chicago     78            78.0
3    David   32      Houston     88            88.0
4      Eva   29      Phoenix     95            95.0

In [35]:
#9. Using .explode() on Lists in a Column

#Modify the DataFrame by adding a Subjects column:
df["Subjects"] = [["Math", "Science"], ["History"], ["Science", "Art"], ["Math", "English"], ["History", "English"]]
#	•	Use .explode() to transform this column so each subject has its own row.
exploded_df = df.explode('Subjects')
exploded_df

      Name  Age         City  Score  City Avg Score Subjects
0    Alice   24     New York     85            85.0     Math
0    Alice   24     New York     85            85.0  Science
1      Bob   27  Los Angeles     90            90.0  History
2  Charlie   22      Chicago     78            78.0  Science
2  Charlie   22      Chicago     78            78.0      Art
3    David   32      Houston     88            88.0     Math
3    David   32      Houston     88            88.0  English
4      Eva   29      Phoenix     95            95.0  History
4      Eva   29      Phoenix     95            95.0  English

In [38]:
#10. Using .melt() for Reshaping

#Convert the DataFrame from wide format to long format where:
#	•	"Name" remains as an identifier,
#	•	"Age" and "Score" are converted into a single column with their corresponding values.

melted_df = pd.melt(exploded_df, id_vars='Name', value_vars=['Age', 'Score'])
melted_df

       Name variable  value
0     Alice      Age     24
1     Alice      Age     24
2       Bob      Age     27
3   Charlie      Age     22
4   Charlie      Age     22
5     David      Age     32
6     David      Age     32
7       Eva      Age     29
8       Eva      Age     29
9     Alice    Score     85
10    Alice    Score     85
11      Bob    Score     90
12  Charlie    Score     78
13  Charlie    Score     78
14    David    Score     88
15    David    Score     88
16      Eva    Score     95
17      Eva    Score     95

In [ ]:
import pandas as pd

# Sample dataset
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Score': [85, 90, 78, 88, 95]
}

df = pd.DataFrame(data)

# 1. Apply a function to categorize age
# Write a function that categorizes 'Age' as 'Young' if <= 25, else 'Old'.
# Apply it to the 'Age' column and store the result in a new column 'Age Group'.
def categorise_age(age):
    if age <= 25:
        return 'young'
    else:
        return 'old'
df['Age Group'] = df['Age'].apply(categorise_age)

# 2. Modify scores using lambda
# Use apply() with a lambda function to increase Score by 5 if > 85, otherwise decrease by 3.
df['New Score'] = df['Score'].apply(lambda x: x+5 if x>85 else x-3)

# 3. Group by City and aggregate avg score and count of people
# Group by 'City' and calculate the mean 'Score' and count of people per city.
grouped_df = df.groupby('City').agg(avg_score=('Score', 'mean'), count_ppl=('Name', 'size'))


# 4. Replace City names with abbreviations
# Use a dictionary to replace full city names with their abbreviations.
city_dict = {'New York':'NY', 'Los Angeles':'LA', 'Chicago':'CH', 'Houston':'HO', 'Phoenix':'PH'}
df['City Abbr.'] = df['City'].map(city_dict)

# 5. Filter columns containing letter 'o'
# Use .filter() to return only columns that contain the letter 'o'.
df.filter(axis=1, regex='o')

# 6. Query rows where Age > 25 and Score > 80
# Use .query() to filter rows where 'Age' is greater than 25 and 'Score' is greater than 80.
df.query('Age > 25 and Score > 80')

# 7. Create a pivot table with City as index and Score mean
# Use pivot_table() to get the mean Score per City.
df.pivot_table(index='City', values='Score', aggfunc='mean')

# 8. Transform to get city-wide average scores for each row
# Use .groupby() with .transform() to add a new column with the average Score per City.
df['Average Score'] = df.groupby('City')['Score'].transform('mean')

# 9. Explode a list column (Subjects) into multiple rows
# Add a 'Subjects' column with lists of subjects and use .explode() to expand it.
df["Subjects"] = [["Math", "Science"], ["History"], ["Science", "Art"], ["Math", "English"], ["History", "English"]]
df = df.explode('Subjects')

# 10. Melt the dataframe from wide to long format
# Use .melt() to reshape the dataframe so 'Age' and 'Score' become a single variable column.
df = df.melt(id_vars='Name', value_vars=['Age', 'Score'])
df

# 11. Merge two DataFrames
# Create an additional DataFrame with 'Name' and 'Department' columns, then merge it with df.
dept = [{'Name': 'Alice', 'Department': 'Finance'},
        {'Name': 'Bob', 'Department': 'HR'},
        {'Name': 'Charlie', 'Department': 'Operations'},
        {'Name': 'David', 'Department': 'Sales'},
        {'Name': 'Eva', 'Department': 'IT'}
        ]
dept_df = pd.DataFrame(dept)
merged_df = pd.merge(df, dept_df, on='Name')
merged_df

# 12. Fill missing values in Score with column mean
# Use .fillna() to replace missing values in the 'Score' column with its mean.
some_dict = [{'A': 'John', 'Score': 3}, {'A': 'Alice', 'Score': 2}, {'A': 'Linda', 'Score': None}]
scores = pd.DataFrame(some_dict)
fill_value = scores['Score'].mean()
scores.fillna(fill_value)

       A  Score
0   John    3.0
1  Alice    2.0
2  Linda    2.5

In [145]:
import pandas as pd

# New dataset: Online Store Transactions
data = {
    'TransactionID': [101, 102, 103, 104, 105, 106],
    'Customer': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Eva'],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Books', 'Clothing', 'Books'],
    'Amount': [250, 80, 120, 30, 60, 15],
    'Discount': [10, 5, 15, 0, 5, 0],
    'Date': ['2023-06-01', '2023-06-02', '2023-06-03', '2023-06-01', '2023-06-04', '2023-06-05']
}

df = pd.DataFrame(data)

# 1. Calculate the net amount (Amount - Discount) and store it in a new column 'Net Amount'
df['Net Amount'] = df['Amount'] - df['Discount']

# 2. Apply a transformation to classify transactions as 'High' if Amount > 100, else 'Low'. Store in 'Transaction Size'.
def categorise_amount(amount):
    if amount > 100:
        return 'High'
    else:
        return 'Low' 
df['Transaction size'] = df['Amount'].apply(categorise_amount)

# 3. Group by 'Customer' and calculate the total amount spent per customer.
grouped_df = df.groupby('Customer').agg(Total=('Amount','sum'))

# 4. Compute the mean transaction amount per category using groupby.
mean_df = df.groupby('Category').agg(Mean=('Amount','mean'))
mean_df

# 5. Create a new column 'Discounted' which is True if Discount > 0, otherwise False.
df['Discounted'] = df['Discount'].apply(lambda x: True if x > 0 else False)

# 6. Filter rows where transactions happened in June and the net amount is greater than 50.
df['Date'] = pd.to_datetime(df['Date'])  # Convert once at the start
filtered_df = df[(df['Date'].dt.month == 6) & (df['Net Amount'] > 50)]

# 7. Create a pivot table with 'Category' as index and aggregate the sum of 'Amount' and mean of 'Discount'.
pivoted_df = df.pivot_table(index='Category', values=['Amount', 'Discount'], aggfunc={'Amount':'sum', 'Discount':'mean'})

# 8. Use transform() to add a new column 'Customer Avg Spend' that contains the average amount spent by each customer.
df['Customer Avg Spend'] = df.groupby('Customer')['Amount'].transform('mean')

# 9. Use apply() with a lambda function to convert 'Date' to datetime and extract the month as a new column 'Month'.
df['Month'] = df['Date'].apply(pd.to_datetime).apply(lambda x: x.month)

# 10. Merge this dataframe with another DataFrame containing customer age info and display the combined data.
age_df = pd.DataFrame([
    {'Customer': 'Alice', 'Age': 21},
    {'Customer': 'Bob', 'Age': 45},
    {'Customer': 'Charlie', 'Age': 46},
    {'Customer': 'David', 'Age': 8},
    {'Customer': 'Eva', 'Age': 13}
])
merged_df = pd.merge(df, age_df, on='Customer')
merged_df

# 11. Fill any missing values in 'Discount' with the overall average discount.
import numpy as np
df['Discount'] = df['Discount'].replace(0, np.nan)  # Replace zeros with NaN
df['Discount Filled'] = df['Discount'].fillna(df['Discount'].mean())

# 12. Sort the dataframe by 'Amount' in descending order and reset the index.
sorted_df = df.sort_values(by='Amount', ascending=False)
sorted_df = sorted_df.reset_index(drop=True)

In [ ]:
import pandas as pd
import numpy as np

# New dataset: Employee Performance and Sales
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Alice', 'Charlie', 'Bob', 'Eva', 'David'],
    'Department': ['Sales', 'HR', 'IT', 'Sales', 'HR', 'Sales', 'IT', 'HR', 'HR', 'Sales'],
    'Sales': [300, np.nan, 150, 500, 120, 450, 200, np.nan, 180, 600],
    'Bonus': [30, 20, 25, 50, 10, 45, 30, 15, 12, 55],
    'Performance Score': [85, 78, 90, 95, 70, 88, 92, 80, 74, 99]
}

df = pd.DataFrame(data)

# 1. Group employees by 'Department' and calculate the total sales per department.
grouped_df = df.groupby('Department').agg(total_sales=('Sales', 'sum'))
# we can create a new DataFrame by selecting a column on whic to group, 'Department', and an aggregate function 
# A similar result can be used by **transforming** the grouped df, with some differences:
    # transforming is used for braodcasting (applying a function to the entire n-dimensional array). Use this if you need the final DF to have the same number of rows / same index
    # wheras aggregating is used for combining data based on a variable. Use this if you just want the aggregate function without duplication.
    # aggregating also allows to perform multiple operations at once or the same operation on multiple columns
transformed_df = df.copy()
transformed_df['Total Sales'] = df.groupby('Department')['Sales'].transform('sum')
multi_grouped_df = df.groupby('Department').agg(total_sales=('Sales', 'sum'), som_agg=('Performance Score', 'mean')) # one agg func per column (allows to create a column name)
multi_grouped_df = df.groupby('Department').agg({'Sales':['sum', 'min'], 'Performance Score':['mean', 'max']}) # multiple agg func per column (assign agg column names)

# 2. Use transform() to create a new column 'Department Avg Sales' that gives the average sales per department.
df['Department Avg Sales'] = df.groupby('Department')['Sales'].transform('mean')
# transform() calls a function (lambda, agg, etc.) and can be applied to the DataFrame, Series or an aggreation of those. 
# in our case we 1) groupby the column 'Department', then we select the Series to transform, 'Sales' and then we pass the function to the transform method, 'mean'

# 3. Use apply() to standardize 'Performance Score' by subtracting the mean and dividing by standard deviation.
ps_mean = df['Performance Score'].mean()
ps_std = df['Performance Score'].std()

def standardise(x):
    x -= ps_mean
    x = x / ps_std
    return x

df['Standardise'] = df['Performance Score'].apply(standardise)
# Important to notice that apply() works as Python LOOP and does not profit from the vectorised numpy operations. It is therefore SLOWER.
    # Use Vectorised ops when you just need to run simpler functions and functions that are mathematical (i.e. representable by the numpy and pandas libraries)
    # Use .apply() if you need more complex functions to run 

# This is an example of a VECTORISED OPERATION using Pandas / numpy (under the hood). 
df['Standardised_gpt'] = (df['Performance Score'] - df['Performance Score'].mean()) / df['Performance Score'].std()

# 4. Use filter() to select only columns containing the word 'Score'.
df.filter(axis=1, regex='Score')

# 5. Use map() to replace department names with abbreviations (e.g., {'Sales': 'S', 'HR': 'H', 'IT': 'I'}).
abb = pd.Series({'Sales': 'S', 'HR': 'H', 'IT': 'I'})
df['Department Abb'] = df['Department'].map(abb)

# but you can use the dictionary directly
abbr_dict = {'Sales': 'S', 'HR': 'H', 'IT': 'I'}
df['Department Abb'] = df['Department'].map(abbr_dict)

# 6. Group by 'Employee' and count the number of sales transactions per employee.
df['Sales per Employee'] = df.groupby('Employee')['Sales'].transform('sum')

# 7. Use transform() to create a column 'Relative Performance' where each employee’s score is divided by the max score in their department.
# get the max score for each department in a column 'Max Department Score'
# divide each individual score by the newly created max score
df['Relative Performance'] = df['Performance Score'] / df.groupby('Department')['Performance Score'].transform('max')

# 8. Use apply() with a lambda function to categorize 'Performance Score' as 'Excellent' (>=90), 'Good' (80-89), or 'Needs Improvement' (<80).
def categorise_perf(n):
    if n >= 90:
        return 'Excellent'
    elif n >= 80 and n < 90:
        return 'Good'
    else:
        return 'Needs Improvement'
df['Performance Category'] = df['Performance Score'].apply(categorise_perf)

# 9. Filter rows where 'Sales' is greater than the department's average sales.
df[df['Sales'] > df.groupby('Department')['Sales'].transform('mean')]

# 10. Create a pivot table showing the sum of 'Sales' and the mean 'Bonus' per 'Department'.
pivoted_df = df.pivot_table(index='Department', values=['Sales', 'Bonus'], aggfunc={'Sales':'sum', 'Bonus':'mean'})
pivoted_df = pivoted_df.rename(columns={'Bonus':'Mean Bonus', 'Sales': 'Total Sales'})

# save a line of code by renaming right away:
pivoted_df = df.pivot_table(index='Department', values=['Sales', 'Bonus'], 
                            aggfunc={'Sales':'sum', 'Bonus':'mean'}
                           ).rename(columns={'Bonus': 'Mean Bonus', 'Sales': 'Total Sales'})

# 11. Merge df with another DataFrame containing Employee tenure in years.
tenure_df = pd.DataFrame([{'Employee': 'Alice', 'Tenure':2}, 
                         {'Employee': 'Bob', 'Tenure':4}, 
                          {'Employee': 'Charlie', 'Tenure':3}, 
                          {'Employee': 'David', 'Tenure':12}, 
                          {'Employee': 'Eva', 'Tenure':9}]
                          )
df = pd.merge(df, tenure_df, on='Employee')

# merge left in case you need to left join instead of inner join
df = df.merge(tenure_df, on='Employee', how='left')  # Keeps all employees from df, even if no tenure info
# also notice that you "df.merge(df2)"" instead of "pd.merge(df, df2)"" - same thing though

# 12. Fill missing values in 'Sales' with the department's average sales.
df['Sales'] = df['Sales'].fillna(df['Department Avg Sales'])

# or if you don't want to create the extra column
df['Sales'] = df['Sales'].fillna(df.groupby('Department')['Sales'].transform('mean'))

df

,Employee,Department,Sales,Bonus,Performance Score,Department Avg Sales,Standardise,Standardised_gpt,Department Abb,Sales per Employee,Relative Performance,Performance Category,Tenure_x,Tenure_y
0,Alice,Sales,300.0,30,85,462.5,-0.010614,-0.010614,S,750.0,0.858586,Good,2,2
1,Bob,HR,150.0,20,78,150.0,-0.753587,-0.753587,H,0.0,0.975000,Needs Improvement,4,4
2,Charlie,IT,150.0,25,90,175.0,0.520081,0.520081,I,350.0,0.978261,Excellent,3,3
3,David,Sales,500.0,50,95,462.5,1.050776,1.050776,S,1100.0,0.959596,Excellent,12,12
4,Eva,HR,120.0,10,70,150.0,-1.602699,-1.602699,H,300.0,0.875000,Needs Improvement,9,9
5,Alice,Sales,450.0,45,88,462.5,0.307803,0.307803,S,750.0,0.888889,Good,2,2
6,Charlie,IT,200.0,30,92,175.0,0.732359,0.732359,I,350.0,1.000000,Excellent,3,3
7,Bob,HR,150.0,15,80,150.0,-0.541309,-0.541309,H,0.0,1.000000,Good,4,4
8,Eva,HR,180.0,12,74,150.0,-1.178143,-1.178143,H,300.0,0.925000,Needs Improvement,9,9
9,David,Sales,600.0,55,99,462.5,1.475332,1.475332,S,1100.0,1.000000,Excellent,12,12

In [100]:
# This is how Vectorised operations vs Loop operations perform on large datasets
start = time.time()
import time
import numpy as np
print("Imports:", time.time() - start)

# generate the large dataframe, in this case we start from an existing df and multiply it a million times: 1M copies + 1M reindexing 
start = time.time()
big_df = pd.concat([df] * 1_000_000, ignore_index=True)
print(f"Pandas df replication: {time.time() - start}, {len(big_df)/1_000_000} million lines")

# compare dataframe creation starting from a large dictionary and then transforming it to a dataframe
# Generate 10 million rows directly
start = time.time()
n = 10_000_000
data = {
    'Employee': np.random.choice(['Alice', 'Bob', 'Charlie', 'David', 'Eva'], size=n),
    'Department': np.random.choice(['Sales', 'HR', 'IT'], size=n),
    'Sales': np.random.randint(50, 1000, size=n),
    'Bonus': np.random.randint(5, 50, size=n),
    'Performance Score': np.random.randint(60, 100, size=n)
}
big_df = pd.DataFrame.from_dict(data)
print(f"Numpy df creation: {time.time() - start}, {len(big_df)/1_000_000} million lines")

start = time.time()
big_df['Standardised'] = (big_df['Performance Score'] - big_df['Performance Score'].mean()) / big_df['Performance Score'].std()
print("Vectorized:", time.time() - start)

start = time.time()
big_df['Standardise'] = big_df['Performance Score'].apply(standardise)
print("Apply:", time.time() - start)

Imports: 0.00020003318786621094
Pandas df replication: 73.70671606063843, 10.0 million lines
Numpy df creation: 1.3377151489257812, 10.0 million lines
Vectorized: 0.04228520393371582
Apply: 1.6211798191070557

In [ ]:
import pandas as pd
import numpy as np

# New dataset: Product Sales and Customer Analysis
data = {
    'OrderID': np.arange(1, 11),
    'Customer': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Alice', 'Charlie', 'Bob', 'Eva', 'David'],
    'Product': ['Laptop', 'Shoes', 'Phone', 'Laptop', 'Shoes', 'Tablet', 'Phone', 'Shoes', 'Tablet', 'Laptop'],
    'Category': ['Electronics', 'Fashion', 'Electronics', 'Electronics', 'Fashion', 'Electronics', 'Electronics', 'Fashion', 'Electronics', 'Electronics'],
    'Price': [1200, 80, 900, 1300, 60, 700, 850, 75, 650, 1400],
    'Quantity': [1, 2, 1, 1, 3, 1, 2, 1, 1, 1],
    'Discount': [50, 5, 30, 60, 10, 20, 25, 5, 15, 75],
    'OrderDate': pd.date_range(start='2023-01-01', periods=10, freq='W')
}

df = pd.DataFrame(data)

# 1. Create a new column 'Total Price' as (Price * Quantity - Discount).
df['Total Price'] = df['Price'] * df['Quantity'] - df['Discount']

# 2. Group by 'Category' and calculate the total revenue per category.
df['Category Revenue'] = df.groupby('Category')['Total Price'].transform('sum') # for broadcasted results
category_revenue = df.groupby('Category', as_index=False)['Total Price'].agg('sum').rename(columns={'Total Price': 'Category Revenue'}) # for a consolidated table

# 3. Use transform() to add a new column 'Avg Price per Category' showing the average price of products in the same category.
df['Avg Price per Category'] = df.groupby('Category')['Total Price'].transform('mean')

# 4. Use apply() to create a new column 'Price Level' categorizing prices as 'Low' (<500), 'Medium' (500-1000), or 'High' (>1000).
def price_categories(x):
    if x < 500:
        return 'Low'
    elif x >= 500 and x <= 1000:
        return 'Medium'
    else:
        return 'High'
    
df['Price Level'] = df['Price'].apply(price_categories)
# you can obtain the same result by mapping items in just the same way. The difference between .map() and .apply() is that 
    # .map() takes a dictionary of values that is precompiled - so it's a little bit like a Case-When statement in SQL
    # .apply() takes a function that interprets the values row by row - so it's a little bit like a LOOP in Python

# 5. Use filter() to select only columns related to pricing ('Price', 'Quantity', 'Discount', 'Total Price').
filtered_df = df.filter(['Price', 'Quantity', 'Discount', 'Total Price'])

# 6. Use map() to replace product names with more generic labels (e.g., {'Laptop': 'Computer', 'Phone': 'Mobile', 'Tablet': 'Device'}).
label_map = {'Laptop': 'Computer', 'Phone': 'Mobile', 'Tablet': 'Device', 'Shoes': 'Apparel'}
df['Product Label'] = df['Product'].map(label_map)

# 7. Group by 'Customer' and count the number of purchases per customer.
df['Purchases per Customer'] = df.groupby('Customer')['Product'].transform('size')
df['Purchases per Customer'] = df.groupby('Customer')['Product'].transform('count') # slighlty faster operation

# 8. Use transform() to create a new column 'Relative Discount' showing each order's discount as a percentage of the max discount in its category.
df['Relative Discount'] = df['Discount'] / df.groupby('Category')['Discount'].transform('max')

# 9. Filter rows where 'Total Price' is higher than the category's average total price.
selected_rows = df[df['Total Price'] > df.groupby('Category')['Total Price'].transform('mean')]

# 10. Create a pivot table showing the sum of 'Quantity' and the average 'Price' per 'Category'.
pivoted_df = df.pivot_table(index='Category', 
                            values=['Price', 'Quantity'], 
                            aggfunc={'Price': 'mean', 'Quantity': 'sum'}
                            ).rename(columns={'Price':'Mean Price', 'Quantity':'Total Quantity'})

# 11. Merge df with another DataFrame containing customer loyalty scores.
scores_df = pd.DataFrame([
    {'Customer': 'Alice', 'Score': 2},
    {'Customer': 'Bob', 'Score': 21},
    {'Customer': 'Charlie', 'Score': 41},
    {'Customer': 'David', 'Score': 13}
])
df = df.merge(scores_df, how='left', on='Customer')

# 12. Fill missing values in 'Discount' with the overall median discount.
df['Discount'] = df['Discount'].fillna(df['Discount'].mean())

pivoted_df

              Mean Price  Total Quantity
Category
Electronics  1000.000000               8
Fashion        71.666667               6

In [172]:
import pandas as pd
import numpy as np

# New dataset: Employee Work Hours and Salary Analysis
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Alice', 'Charlie', 'Bob', 'Eva', 'David'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
    'Work Hours': [40, 35, 50, 45, 38, 42, 47, 37, 44, 48],
    'Hourly Wage': [25, 30, 40, 35, 28, 42, 38, 27, 45, 32],
    'Bonus': [500, 600, 700, 550, 580, 750, 620, 540, 680, 590],
    'Hire Date': pd.date_range(start='2015-01-01', periods=10, freq='YE')
}

df = pd.DataFrame(data)

# 1. Create a new column 'Total Salary' calculated as (Work Hours * Hourly Wage + Bonus).
df['Total Salary'] = df['Work Hours'] * df['Hourly Wage'] + df['Bonus']

# 2. Group by 'Department' and compute the total salary expense per department.
salary_expenses = df.groupby('Department', as_index=False)['Total Salary'].agg('sum').rename(columns={'Total Salary': 'Total Dept Salary'})

# 3. Use transform() to add a column 'Average Work Hours' showing the average work hours per department.
df['Average Work Hours'] = df.groupby('Department')['Work Hours'].transform('mean')

# 4. Use apply() to classify employees as 'Overtime' (> 45 hours) or 'Standard' (<= 45 hours).
def hours_class(x):
    if x > 45:
        return 'Overtime'
    else:
        return 'Standard'
df['Class Hours'] = df['Work Hours'].apply(hours_class)

# an elegant alternative way is using where from np
df['Class Hours'] = np.where(df['Work Hours'] > 45, 'Overtime', 'Standard')

# 5. Use filter() to select only columns related to salary and work hours ('Work Hours', 'Hourly Wage', 'Bonus', 'Total Salary').
filtered_df = df[['Work Hours', 'Hourly Wage', 'Bonus', 'Total Salary']]

# 6. Use map() to replace department names with abbreviated versions (e.g., {'HR': 'Human Resources', 'IT': 'Information Tech', 'Finance': 'Fin'}).
dept_abb = {'HR': 'Human Resources', 'IT': 'Information Tech', 'Finance': 'Fin'}
df['Dept Abb'] = df['Department'].map(dept_abb)

# 7. Group by 'Employee' and count the number of work records per employee.
record_count = df.groupby('Employee', as_index=False)['Hire Date'].agg('count').rename(columns={'Hire Date': 'Record per Employee'})
# this is correct but it uses a separate column to compute the number of recors, which is inefficient and leads to discrepancies
# just apply the size function to the grouped column
record_count = df.groupby('Employee', as_index=False).size().rename(columns={'size': 'Record per Employee'})

# 8. Use transform() to create a new column 'Relative Wage' showing each employee’s hourly wage as a percentage of the max hourly wage in their department.
df['Relative Wage'] = df['Hourly Wage'] / df.groupby('Department')['Hourly Wage'].transform('max')

# 9. Filter rows where 'Total Salary' is higher than the department's average total salary.
selected_salaries = df[df['Total Salary'] > df.groupby('Department')['Total Salary'].transform('mean')]

# 10. Create a pivot table displaying the sum of 'Work Hours' and the mean 'Hourly Wage' per 'Department'.
pivvy = df.pivot_table(index='Department', 
                       values=['Work Hours', 'Hourly Wage'], 
                       aggfunc={'Work Hours':'sum', 'Hourly Wage':'mean'}
                       ).rename(columns={'Work Hours':'Sum WH', 'Hourly Wage':'Mean HW'})

# this is a less redundant approach:
pivvy = df.pivot_table(index='Department', 
                       #values=['Work Hours', 'Hourly Wage'], 
                       aggfunc={'Work Hours':'sum', 'Hourly Wage':'mean'}
                       ).rename(columns={'Work Hours':'Sum WH', 'Hourly Wage':'Mean HW'})
pivvy

# 11. Merge df with another DataFrame containing years of experience for each employee.
years_exp_employee = pd.DataFrame([{'Employee':'', 'Years': None}])
df = df.merge(years_exp_employee, how='left', on='Employee')

# 12. Fill missing values in 'Bonus' with the median bonus per department.
df['Bonus'] = df['Bonus'].fillna(df.groupby('Department')['Bonus'].transform('median'))

pivvy

              Mean HW  Sum WH
Department
Finance     42.333333     136
HR          26.666667     115
IT          33.750000     175